[
  {
    "url": "https://www.cnbc.com/2025/09/12/massachusetts-sues-kalshi-sports-gambling.html",
    "title": "Massachusetts sues Kalshi alleging illegal sports gambling",
    "content": "Massachusetts argues Kalshi is making more money on sports wagers than legal, licensed sportsbooks."
  },
  {
    "url": "https://www.cbssports.com/college-football/news/college-football-picks-predictions-odds-betting-lines-week-3-games/",
    "title": "College football picks: Predictions against the spread, odds, betting lines for top 25 games in Week 3",
    "content": "A closer look at the top games for the second week of the 2025 college football season"
  },
  {
    "url": "https://variety.com/2025/film/news/paramount-condemns-israeli-film-boycott-1236516511/",
    "title": "Paramount Condemns Israeli Film Boycott After 3,900 Sign Pledge",
    "content": "Paramount released a statement condemning a boycott of the Israeli film industry after 3,900 industry names signed the pledge."
  },
  {
    "url": "https://www.huffpost.com/entry/margot-robbie-dons-gorgeous-naked-dress-on-red-carpet-but-its-getting-some-backlash_n_68c44c56e4b0b505740851dc",
    "title": "Margot Robbie Dons Gorgeous ‘Naked Dress’ On Red Carpet, But It’s Getting Some Backlash",
    "content": "The “Barbie” star’s risque look is prompting love, hate and befuddlement on social media platforms."
  },
  {
    "url": "https://www.cbsnews.com/losangeles/news/california-legislature-bill-law-enforcement-face-coverings/",
    "title": "Bill passed by California Legislature prohibiting some law enforcement officers from wearing face coverings heads to Gov. Newsom",
    "content": "If signed by Gov. Gavin Newsom, Senate Bill 627, known as the No Secret Police Act, would apply to California local and federal officers, and other officers from another state agency."
  },
  {
    "url": "https://abcnews.go.com/Politics/trump-hell-send-national-guard-memphis-combat-crime/story?id=125509847",
    "title": "Trump says he'll send National Guard to 'deeply troubled' Memphis",
    "content": "President Trump announced in that the federal government is planning to surge federal forces, National Guard and even \"the military, too,\" if needed into Memphis."
  },
  {
    "url": "https://www.espn.com/nfl/story/_/id/46236305/giants-qb2-jaxson-dart-ready-whenever-my-number-called",
    "title": "Giants QB2 Jaxson Dart 'ready whenever my number is called'",
    "content": "Giants rookie quarterback Jaxson Dart isn't listening to the public calls for him to become the team's starter, but promises to be \"ready whenever my number is called.\""
  },
  {
    "url": "https://fortune.com/2025/09/12/ray-dalio-ai-winners-losers-jobs-redistribution-policy/",
    "title": "Ray Dalio calls for 'redistribution policy' when AI and humanoid robots start to benefit the top 1% to 10% more than everyone else",
    "content": "The hedge fund billionaire sees a \"limited number of winners and a bunch of losers\" with the 1% to 10% \"benefiting a lot.\""
  },
  {
    "url": "https://chicago.suntimes.com/donald-trump/2025/09/12/donald-trump-national-guard-deployment-memphis-not-chicago-crime",
    "title": "Trump says he’ll send the National Guard to Memphis to address crime, 'would have preferred' Chicago",
    "content": "Mayor Brandon Johnson says united local opposition to a federal intervention led the president to \"back down.\""
  },
  {
    "url": "https://apnews.com/article/charlie-kirk-video-violence-content-moderation-c6aa91558f5827c59aed1e82893a8ce6",
    "title": "Widespread availability of graphic Charlie Kirk shooting video shows content moderation challenges",
    "content": "Immediately after Charlie Kirk was shot during a college event in Utah, graphic video of what happened was available almost instantly online, from several angles, in slow-motion and real-time speed."
  }
]